### 공공데이터

In [1]:
import pandas as pd

In [6]:
path=r'C:\Users\user\Documents\Python Scripts\테스트.csv'
df = pd.read_csv(path,encoding = 'CP949')

In [7]:
df.head()

   학번  이름   파이선
0   1   권   NaN
1   2   임  10.0
2   3  멋1  30.0
3   4  멋2  40.0
4   5  멋3  50.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
학번     10 non-null int64
이름     10 non-null object
파이선    9 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 368.0+ bytes

In [12]:
df.shape

(10, 3)

In [10]:
df.columns

Index(['학번', '이름', '파이선'], dtype='object')

In [11]:
df.isnull()

      학번     이름    파이선
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False